## SQL Quuery Questions

1. Select all columns and rows from a table.

-> SELECT *
FROM Employees;

---
2. Select specific columns from a table.

-> SELECT FirstName, LastName, Salary
FROM Employees;

---
3. Filter rows using WHERE clause.

-> SELECT *
FROM Employees
WHERE DepartmentID = 101;

---
4. Filter with multiple conditions (AND, OR).

-> SELECT *
FROM Employees
WHERE Salary > 70000 AND DepartmentID = 102;

---

5. Order results (ORDER BY).

-> SELECT *
FROM Employees
ORDER BY Salary DESC;

---

**Que**: Retrieve employees, ordered by DepartmentID (ascending) and then by Salary (descending) within each department.

**ANS**:

    SELECT *
    FROM Employees
    ORDER BY DepartmentID ASC, Salary DESC;

---

**Que**: How many employees are there in total?

**ANS**: 
    
    1. SELECT COUNT(EmployeeID) AS TotalEmployees
        FROM Employees;

    2. SELECT COUNT(*) AS TotalEmployees
        FROM Employees;

---

**Que**: Count the number of employees in DepartmentID 101.

**Ans**:

    SELECT COUNT(EmployeeID) AS EmployeesInDept101
    FROM Employees
    WHERE DepartmentID = 101;

---

**Que**: Calculate the total salary of all employees.

**Ans**

    SELECT SUM(Salary) AS TotalSalary
    FROM Employees;

---

**Que** What is the average salary of employees?

**Ans**

    SELECT AVG(Salary) AS AverageSalary
    FROM Employees;

---

**Que** Find the highest and lowest salary.

**Ans**

    SELECT MAX(Salary) AS HighestSalary, MIN(Salary) AS LowestSalary
    FROM Employees;

---

**Que**: Find the total and average salary for each department.

**Ans**:
    
    SELECT
    DepartmentID,
    SUM(Salary) AS TotalDepartmentSalary,
    AVG(Salary) AS AverageDepartmentSalary
    FROM
        Employees
    GROUP BY
        DepartmentID;

---

**Que**: List departments that have an average salary greater than 70000.

**Ans**

    SELECT
        DepartmentID,
        AVG(Salary) AS AverageDepartmentSalary
    FROM
        Employees
    GROUP BY
        DepartmentID
    HAVING
        AVG(Salary) > 70000;

---

**Que**: Get the FirstName, LastName, Salary, and DepartmentName for all employees.

**Ans**:

    SELECT
    E.FirstName,
    E.LastName,
    E.Salary,
    D.DepartmentName
    FROM
        Employees E
    INNER JOIN
        Departments D ON E.DepartmentID = D.DepartmentID;

---

**Que**: List all departments and, for each department, list the FirstName and LastName of their employees. Include departments even if they have no employees.

**Ans**:

    SELECT
    D.DepartmentName,
    E.FirstName,
    E.LastName
    FROM
        Departments D
    LEFT JOIN
        Employees E ON D.DepartmentID = E.DepartmentID;

---

**Que**: Find the names of employees who earn more than the average salary of all employees.

**Ans**:

    SELECT FirstName, LastName, Salary
    FROM Employees
    WHERE Salary > (SELECT AVG(Salary) FROM Employees);

---

**Que**: Find the 2nd highest salary from the Employees table.

**Ans**:

1. 
    
    SELECT Salary
    FROM (
        SELECT
            Salary,
            DENSE_RANK() OVER (ORDER BY Salary DESC) as rnk
        FROM
            Employees
    ) AS RankedSalaries
    WHERE rnk = 2;


2. 

    SELECT DISTINCT Salary
    FROM Employees
    ORDER BY Salary DESC
    LIMIT 1 OFFSET 1;

3. 

    SELECT MAX(Salary)
    FROM Employees
    WHERE Salary < (SELECT MAX(Salary) FROM Employees);

---

**Que**: Identify any FirstName, LastName combinations that appear more than once in the Employees table.

**Ans**:

    SELECT
        FirstName,
        LastName,
        COUNT(*) AS DuplicateCount
    FROM
        Employees
    GROUP BY
        FirstName,
        LastName
    HAVING
        COUNT(*) > 1;

---

**Que**: Delete all employees who work in DepartmentID 104.

**Ans**:

    DELETE FROM Employees
    WHERE DepartmentID = 104;

---

**Que**:  Increase the salary of all employees in DepartmentID 101 by 10%.

**Ans**:

    UPDATE Employees
    SET Salary = Salary * 1.10
    WHERE DepartmentID = 101;

---

**Que**: Display employee names and a 'SalaryCategory' based on their salary: 'High' (>70000), 'Medium' (50000-70000), 'Low' (<50000).

**Ans**:

    SELECT
    FirstName,
    LastName,
    Salary,
    CASE
        WHEN Salary > 70000 THEN 'High'
        WHEN Salary >= 50000 AND Salary <= 70000 THEN 'Medium'
        ELSE 'Low'
    END AS SalaryCategory
    FROM
        Employees;

---